{
    "data": [
      {
        "title": "SA vs AFG Live: Rickelton, Bavuma 100-run stand defies Afghanistan",
        "summary": "",
        "image_url": "https://static.toiimg.com/photo/msid-118441581,imgsize-49078.cms"
      },
      {
        "title": "Shami’s triumphant India comeback: Grit, grind & a memorable fifer",
        "summary": "Riding on Mohammed Shami's 5 for 53 and Shubman Gill's excellent hundred, India registered a comfortable six-wicket win over Bangladesh in their opening match of Champions Trophy  in Dubai on Thursday. Pacer Shami returned to an ICC tournament with a five-wicket haul to help his team bowl out Bangladesh for 228. In reply, India completed the chase with 21 balls to spare.",
        "image_url": "https://static.toiimg.com/photo/msid-118446411,imgsize-155746.cms"
      },
      {
        "title": "Kerala make history, reach first-ever Ranji Trophy final",
        "summary": "Kerala made history by qualifying for their first Ranji Trophy final, narrowly defeating Gujarat with a two-run first-innings lead in a dramatic semifinal. Key performances included M Azharuddeen’s 177 runs and a crucial final moment involving Arzan Nagwaswalla and Salman Nizar. Kerala will now face Vidarbha in the final, carrying the hopes of their state.",
        "image_url": "https://static.toiimg.com/photo/msid-118449374,imgsize-79018.cms"
      },
      {
        "title": "India are strong, but every team is beatable: Pakistan all-rounder",
        "summary": "Pakistan all-rounder Khushdil Shah believes they can defeat India by bringing their best performance to the upcoming Champions Trophy clash. Despite a rough start, he emphasises that handling pressure will be crucial. He also addressed criticism about his selection, urging fans to continue their support. Pakistan face a must-win situation after losing to New Zealand.",
        "image_url": "https://static.toiimg.com/photo/msid-118448657,imgsize-126130.cms"
      },
      {
        "title": "'Never had any fear ... it's Bangladesh, not Aus or Pak': Sehwag",
        "summary": "India chased down Bangladesh's total of 228 with 21 balls remaining in their ICC Champions Trophy opener, despite some mild concern at 144/4. Virender Sehwag dismissed Bangladesh as a serious threat, suggesting that the win could have been swifter if more wickets had been preserved. India secured victory with 21 balls remaining, thanks to a significant partnership between KL Rahul and Shubman Gill, with the latter reaching his century.",
        "image_url": "https://static.toiimg.com/photo/msid-118448514,imgsize-119812.cms"
      },
      {
        "title": "CT: Why Pakistan will be under more pressure against India",
        "summary": "Pakistan will face India in a crucial Champions Trophy match in Dubai, following their significant loss to New Zealand. Needing a win to keep semi-final hopes alive, Pakistan has recently been struck by injuries. India, meanwhile, remains confident after a decisive victory over Bangladesh.",
        "image_url": "https://static.toiimg.com/photo/msid-118445054,imgsize-67702.cms"
      },
      {
        "title": "Ponting lauds Mohammed Shami's heroics against Bangladesh",
        "summary": "Former Australian captain Ricky Ponting praised Indian fast bowler Mohammed Shami for his remarkable five-wicket haul in India's Champions Trophy opener against Bangladesh. Ponting highlighted Shami's resilience and determination following his recovery from a long injury layoff. Shami's achievement of 200 ODI wickets underscores his consistency and dedication, earning appreciation for his performance amidst adversity.",
        "image_url": "https://static.toiimg.com/photo/msid-118448473,imgsize-98290.cms"
      },
      {
        "title": "Heinrich Klaasen ruled out of Champions Trophy opener vs Afghanistan",
        "summary": "South Africa's star wicketkeeper-batter missed the opening match of the ICC Champions Trophy 2025 against Afghanistan due to an elbow injury. Captain Temba Bavuma won the toss, opting to bat first. Afghanistan made their Champions Trophy debut with a three-man spin attack led by Rashid Khan. This match marks Afghanistan’s debut in the Champions Trophy.",
        "image_url": "https://static.toiimg.com/photo/msid-118447069,imgsize-44564.cms"
      },
      {
        "title": "Five controversial India-Pakistan moments in ODI cricket",
        "summary": "Pakistan and India renew their fierce cricket rivalry in a thrilling clash at the Champions Trophy in Dubai. From Miandad’s kangaroo antics to Inzamam's confrontation with a fan, the match is poised to bring high-stakes drama and unforgettable moments on the field.",
        "image_url": "https://static.toiimg.com/photo/msid-118443461,imgsize-59296.cms"
      },
      {
        "title": "India's opening win in CT 2025 sends records tumbling",
        "summary": "India kicked off their Champions Trophy campaign with a dominating win over Bangladesh in Dubai. Mohammed Shami took five wickets, becoming India's most successful bowler in 50-over ICC events. Shubman Gill scored an unbeaten century, which is his 8th in ODIs in record time, while Rohit Sharma achieved his milestone of 11,000 ODI runs.",
        "image_url": "https://static.toiimg.com/photo/msid-118442037,imgsize-94960.cms"
      },
      {
        "title": "Watch: MI unveil IPL 2025 jersey with Hardik's emotional message to fans",
        "summary": "Mumbai Indians unveiled their IPL 2025 jersey with captain Hardik Pandya and key players vowing to honour the team's legacy. The new blue and gold jersey signifies trust, confidence, and the pursuit of excellence. The team, aiming to bounce back from a poor 2024 season, will face Chennai Super Kings in the opening match on March 23.",
        "image_url": "https://static.toiimg.com/photo/msid-118443482,imgsize-22328.cms"
      },
      {
        "title": "Harshit Rana credits Bumrah for consistency and adaptability",
        "summary": "Indian bowler Harshit Rana credited Jasprit Bumrah and coach Morne Morkel for his development after making debuts in all formats. Speaking after India's six-wicket win against Bangladesh, he highlighted the influence of their guidance on his consistency and performance, including ahead of the upcoming India-Pakistan match.",
        "image_url": "https://static.toiimg.com/photo/msid-118442809,imgsize-60014.cms"
      },
      {
        "title": "Gill's finest: A 'satisfying' hundred built on patience, precision and poise",
        "summary": "Shubman Gill's century in the ODI against Bangladesh was marked by immense satisfaction and maturity. Despite a slow start, Gill adapted his game to counter Bangladesh's spin pressure, maintaining control and clarity. His innings ensured India’s win, showcasing brilliant strokes and a contained performance, earning him the Player of the Match award.",
        "image_url": "https://static.toiimg.com/photo/msid-118437721,imgsize-93494.cms"
      },
      {
        "title": "'Nothing to worry about ...': Ibrahim Zadran ahead of AFG vs SA clash",
        "summary": "Afghanistan, led by captain Hashmatullah Shahidi, seek to build on their recent successes as they kick off their 2025 ICC Champions Trophy campaign against South Africa in Karachi. With a strong batting lineup and formidable bowlers like Rashid Khan, the team is confident in challenging top-tier teams, aiming for a semifinal spot.",
        "image_url": "https://static.toiimg.com/photo/msid-118439970,imgsize-141588.cms"
      },
      {
        "title": "CT: Shami dedicates brilliant show to 'role model' father",
        "summary": "Mohammed Shami celebrated his fifer during India's win over Bangladesh with a gesture dedicated to his late father. Backed by skipper Rohit Sharma, Shami became the fastest Indian to 200 ODI wickets. Reflecting on his journey, Shami emphasized the importance of dedication, persistence, and living in the present while acknowledging past challenges.",
        "image_url": "https://static.toiimg.com/photo/msid-118439595,imgsize-181484.cms"
      },
      {
        "title": "CT: Action shifts to Group B after India's dominating win",
        "summary": "India launched their pursuit of another ICC title with a commanding six-wicket victory over Bangladesh in Dubai. Shubman Gill's unbeaten century (101 not out) and Mohammed Shami's five-wicket haul (5 for 53) were instrumental in India's success. Despite the win, though, India remain second in Group A, behind New Zealand on net run-rate.",
        "image_url": "https://static.toiimg.com/photo/msid-118433889,imgsize-43524.cms"
      },
      {
        "title": "Shubman Gill takes 60 fewer innings than Tendulkar for this big feat",
        "summary": "Shubman Gill scored an unbeaten 101 as India triumphed over Bangladesh by six wickets in their ICC Champions Trophy opener. Gill's performance, his eighth ODI century in just 51 innings, sets a new national record. His composed innings was crucial, leading India to successfully chase a 229-run target, completing the match with 21 balls remaining.",
        "image_url": "https://static.toiimg.com/photo/msid-118436262,imgsize-178062.cms"
      },
      {
        "title": "Empty stands even for India's match: Are ODIs dying?",
        "summary": "The sparsely attended ICC 2025 Champions Trophy matches in Dubai and Karachi have raised concerns about the declining interest in ODI cricket. With fan engagement dropping, questions are emerging about the relevance and future of the format, as compared to the more popular T20 leagues.",
        "image_url": "https://static.toiimg.com/photo/msid-118435249,imgsize-92868.cms"
      },
      {
        "title": "TOISA 2024: Who will take home the top honour?",
        "summary": "India's top athletes have been nominated for the Sportsperson of the Year category at the TOISA 2024 awards in Lucknow. Nominees include Neeraj Chopra, Jasprit Bumrah, Gukesh Dommaraju, and Manu Bhaker, celebrated for their exceptional achievements in athletics, cricket, chess, and shooting respectively. The winners will be unveiled on February 22.",
        "image_url": "https://static.toiimg.com/photo/msid-118439229,imgsize-35004.cms"
      },
      {
        "title": "Sourav Ganguly meets with car accident, no injuries reported",
        "summary": "Sourav Ganguly narrowly avoided a major accident after his car was involved in a collision caused by a lorry on the Durgapur Expressway. Despite the delay and minor damage to vehicles in his convoy, Ganguly continued his journey to Burdwan University, where he attended scheduled events and shared insights from his cricket career.",
        "image_url": "https://static.toiimg.com/photo/msid-118437352,imgsize-28366.cms"
      }
    ],
    "message": "News fetched successfully."
  }